================================================================================
one line quote
================================================================================

sp {one-line-quote
    "stuff that I think is cool"
    ()
-->
}
--------------------------------------------------------------------------------

(source_file
  (production
    (prod_name)
    (documentation)
    (condsForOneId)))

================================================================================
two line quote
================================================================================

sp {two-line-quote
    "stuff that I
    think is cool"
    ()
-->
}
--------------------------------------------------------------------------------

(source_file
  (production
    (prod_name)
    (documentation)
    (condsForOneId)))

================================================================================
utf8
================================================================================

sp {utf8
    "ã"
    ()
-->
}
--------------------------------------------------------------------------------

(source_file
  (production
    (prod_name)
    (documentation)
    (condsForOneId)))

================================================================================
escaped quote
================================================================================

sp {escaped
    "stuff that I \"think is cool"
    ()
-->
}
--------------------------------------------------------------------------------

(source_file
  (production
    (prod_name)
    (documentation)
    (condsForOneId)))

================================================================================
two lines, two quotes
================================================================================

sp {twice-doc
    "this production"
    "shouldn't load"
    ()
-->
}
--------------------------------------------------------------------------------

(source_file
  (production
    (prod_name)
    (ERROR
      (documentation))
    (documentation)
    (condsForOneId)))

================================================================================
missing quote
================================================================================

sp {twice-doc
    "bad
    ()
-->
}
--------------------------------------------------------------------------------

(source_file
  (ERROR
    (prod_name)))
