================================================================================
one line quote
================================================================================

sp {one-line-quote
    "stuff that I think is cool"
    ()
-->
}
--------------------------------------------------------------------------------

(source_file
  (production
    (beginning
      (prod_name)
      (documentation))
    (LHS
      (cond
        (positiveCond
          (condsForOneId))))))

================================================================================
two line quote
================================================================================

sp {two-line-quote
    "stuff that I
    think is cool"
    ()
-->
}
--------------------------------------------------------------------------------

(source_file
  (production
    (beginning
      (prod_name)
      (documentation))
    (LHS
      (cond
        (positiveCond
          (condsForOneId))))))

================================================================================
utf8
================================================================================

sp {utf8
    "ぐ"
    ()
-->
}
--------------------------------------------------------------------------------

(source_file
  (production
    (beginning
      (prod_name)
      (documentation))
    (LHS
      (cond
        (positiveCond
          (condsForOneId))))))

================================================================================
escaped quote
================================================================================

sp {escaped
    "stuff that I \"think is cool"
    ()
-->
}
--------------------------------------------------------------------------------

(source_file
  (production
    (beginning
      (prod_name)
      (documentation))
    (LHS
      (cond
        (positiveCond
          (condsForOneId))))))

================================================================================
two lines, two quotes
================================================================================

sp {twice-doc
    "this production"
    "shouldn't load"
    ()
-->
}
--------------------------------------------------------------------------------

(source_file
  (production
    (beginning
      (prod_name)
      (ERROR
        (documentation))
      (documentation))
    (LHS
      (cond
        (positiveCond
          (condsForOneId))))))

================================================================================
missing quote
================================================================================

sp {twice-doc
    "bad
    ()
-->
}
--------------------------------------------------------------------------------

(source_file
  (ERROR
    (prod_name)))
