================================================================================
x.x
================================================================================

sp {one
    (state <s> ^foo 1.2)
-->    (<s> ^foo foo)
}
--------------------------------------------------------------------------------

(source_file
  (production
    (beginning
      (prod_name))
    (cond
      (positiveCond
        (condsForOneId
          (condType)
          (idTest
            (test
              (simpleTest
                (singleTest
                  (variable)))))
          (attrValueTests
            (attrTest
              (test
                (simpleTest
                  (singleTest
                    (string)))))
            (valueTest
              (test
                (simpleTest
                  (singleTest
                    (floatConstant)))))))))
    (variableMutation
      (variable)
      (attrValueMake
        (string)
        (valueMake
          (string))))))

================================================================================
-x.x
================================================================================

sp {neg-x-x
    (state <s> ^foo -1.3)
-->    (<s> ^foo foo)
}
--------------------------------------------------------------------------------

(source_file
  (production
    (beginning
      (prod_name))
    (cond
      (positiveCond
        (condsForOneId
          (condType)
          (idTest
            (test
              (simpleTest
                (singleTest
                  (variable)))))
          (attrValueTests
            (attrTest
              (test
                (simpleTest
                  (singleTest
                    (string)))))
            (valueTest
              (test
                (simpleTest
                  (singleTest
                    (floatConstant)))))))))
    (variableMutation
      (variable)
      (attrValueMake
        (string)
        (valueMake
          (string))))))

================================================================================
x.xex
================================================================================

sp {x-xex
    (state <s> ^foo 4.3e5)
-->    (<s> ^foo foo)
}
--------------------------------------------------------------------------------

(source_file
  (production
    (beginning
      (prod_name))
    (cond
      (positiveCond
        (condsForOneId
          (condType)
          (idTest
            (test
              (simpleTest
                (singleTest
                  (variable)))))
          (attrValueTests
            (attrTest
              (test
                (simpleTest
                  (singleTest
                    (string)))))
            (valueTest
              (test
                (simpleTest
                  (singleTest
                    (floatConstant)))))))))
    (variableMutation
      (variable)
      (attrValueMake
        (string)
        (valueMake
          (string))))))

================================================================================
x.xE-x
================================================================================

sp {neg-x-xE-x
    (state <s> ^foo 4.3E-5)
-->    (<s> ^foo foo)
}
--------------------------------------------------------------------------------

(source_file
  (production
    (beginning
      (prod_name))
    (cond
      (positiveCond
        (condsForOneId
          (condType)
          (idTest
            (test
              (simpleTest
                (singleTest
                  (variable)))))
          (attrValueTests
            (attrTest
              (test
                (simpleTest
                  (singleTest
                    (string)))))
            (valueTest
              (test
                (simpleTest
                  (singleTest
                    (floatConstant)))))))))
    (variableMutation
      (variable)
      (attrValueMake
        (string)
        (valueMake
          (string))))))

================================================================================
-x.xE-x
================================================================================

sp {neg-x-xE-x
    (state <s> ^foo -4.3E-5)
-->    (<s> ^foo foo)
}
--------------------------------------------------------------------------------

(source_file
  (production
    (beginning
      (prod_name))
    (cond
      (positiveCond
        (condsForOneId
          (condType)
          (idTest
            (test
              (simpleTest
                (singleTest
                  (variable)))))
          (attrValueTests
            (attrTest
              (test
                (simpleTest
                  (singleTest
                    (string)))))
            (valueTest
              (test
                (simpleTest
                  (singleTest
                    (floatConstant)))))))))
    (variableMutation
      (variable)
      (attrValueMake
        (string)
        (valueMake
          (string))))))

================================================================================
-x.xd
================================================================================

sp {neg-x-xd
    (state <s> ^foo -4.3d)
-->    (<s> ^foo foo)
}
--------------------------------------------------------------------------------

(source_file
  (production
    (beginning
      (prod_name))
    (cond
      (positiveCond
        (condsForOneId
          (condType)
          (idTest
            (test
              (simpleTest
                (singleTest
                  (variable)))))
          (attrValueTests
            (attrTest
              (test
                (simpleTest
                  (singleTest
                    (string)))))
            (valueTest
              (test
                (simpleTest
                  (singleTest
                    (floatConstant)))))))))
    (variableMutation
      (variable)
      (attrValueMake
        (string)
        (valueMake
          (string))))))

================================================================================
-x.xf
================================================================================

sp {neg-x-xf
    (state <s> ^foo -4.3f)
-->    (<s> ^foo foo)
}
--------------------------------------------------------------------------------

(source_file
  (production
    (beginning
      (prod_name))
    (cond
      (positiveCond
        (condsForOneId
          (condType)
          (idTest
            (test
              (simpleTest
                (singleTest
                  (variable)))))
          (attrValueTests
            (attrTest
              (test
                (simpleTest
                  (singleTest
                    (string)))))
            (valueTest
              (test
                (simpleTest
                  (singleTest
                    (floatConstant)))))))))
    (variableMutation
      (variable)
      (attrValueMake
        (string)
        (valueMake
          (string))))))

================================================================================
-x.xD
================================================================================

sp {neg-x-xD
    (state <s> ^foo -4.3D)
-->    (<s> ^foo foo)
}
--------------------------------------------------------------------------------

(source_file
  (production
    (beginning
      (prod_name))
    (cond
      (positiveCond
        (condsForOneId
          (condType)
          (idTest
            (test
              (simpleTest
                (singleTest
                  (variable)))))
          (attrValueTests
            (attrTest
              (test
                (simpleTest
                  (singleTest
                    (string)))))
            (valueTest
              (test
                (simpleTest
                  (singleTest
                    (floatConstant)))))))))
    (variableMutation
      (variable)
      (attrValueMake
        (string)
        (valueMake
          (string))))))

================================================================================
-x.xF
================================================================================

sp {neg-x-xF
    (state <s> ^foo -4.3F)
-->    (<s> ^foo foo)
}
--------------------------------------------------------------------------------

(source_file
  (production
    (beginning
      (prod_name))
    (cond
      (positiveCond
        (condsForOneId
          (condType)
          (idTest
            (test
              (simpleTest
                (singleTest
                  (variable)))))
          (attrValueTests
            (attrTest
              (test
                (simpleTest
                  (singleTest
                    (string)))))
            (valueTest
              (test
                (simpleTest
                  (singleTest
                    (floatConstant)))))))))
    (variableMutation
      (variable)
      (attrValueMake
        (string)
        (valueMake
          (string))))))
