================================================================================
strings
================================================================================

sp {strings
    (state <s> ^foo { a b })
-->    (<s> ^foo bar)
}

--------------------------------------------------------------------------------

(source_file
  (production
    (prod_name)
    (condsForOneId
      (condType)
      (idTest
        (variable))
      (attrValueTests
        (string)
        (valueTest
          (conjunctiveTest
            (string)
            (string)))))
    (variableMutation
      (variable)
      (attrValueMake
        (string)
        (valueMake
          (string))))))

================================================================================
strings no space
================================================================================

sp {strings-spaceless
    (state <s> ^foo {a b})
-->    (<s> ^foo bar)
}

--------------------------------------------------------------------------------

(source_file
  (production
    (prod_name)
    (condsForOneId
      (condType)
      (idTest
        (variable))
      (attrValueTests
        (string)
        (valueTest
          (conjunctiveTest
            (string)
            (string)))))
    (variableMutation
      (variable)
      (attrValueMake
        (string)
        (valueMake
          (string))))))

================================================================================
quotes
================================================================================

sp {quoted
    (state <s> ^foo { |a| |\|b| |c| })
-->    (<s> ^foo bar)
}

--------------------------------------------------------------------------------

(source_file
  (production
    (prod_name)
    (condsForOneId
      (condType)
      (idTest
        (variable))
      (attrValueTests
        (string)
        (valueTest
          (conjunctiveTest
            (quoted)
            (quoted)
            (quoted)))))
    (variableMutation
      (variable)
      (attrValueMake
        (string)
        (valueMake
          (string))))))

================================================================================
disjunct
================================================================================

sp {disjunct
    (state <s> ^foo { << a b c >> << t u >> })
-->    (<s> ^foo bar)
}

--------------------------------------------------------------------------------

(source_file
  (production
    (prod_name)
    (condsForOneId
      (condType)
      (idTest
        (variable))
      (attrValueTests
        (string)
        (valueTest
          (conjunctiveTest
            (disjunctionTest
              (string)
              (string)
              (string))
            (disjunctionTest
              (string)
              (string))))))
    (variableMutation
      (variable)
      (attrValueMake
        (string)
        (valueMake
          (string))))))

================================================================================
variable
================================================================================

sp {variable
    (state <s> ^foo { <bar> baz })
-->    (<s> ^foo bar)
}

--------------------------------------------------------------------------------

(source_file
  (production
    (prod_name)
    (condsForOneId
      (condType)
      (idTest
        (variable))
      (attrValueTests
        (string)
        (valueTest
          (conjunctiveTest
            (variable)
            (string)))))
    (variableMutation
      (variable)
      (attrValueMake
        (string)
        (valueMake
          (string))))))

================================================================================
should fail without closing brace
================================================================================

sp {no-ending
    (state <s> ^foo {a b)
-->    (<s> ^foo bar)
}

--------------------------------------------------------------------------------

(source_file
  (production
    (prod_name)
    (condsForOneId
      (condType)
      (idTest
        (variable))
      (attrValueTests
        (string)
        (valueTest
          (conjunctiveTest
            (string)
            (string)
            (MISSING "}")))))
    (variableMutation
      (variable)
      (attrValueMake
        (string)
        (valueMake
          (string))))))

================================================================================
should fail without opening brace
================================================================================

sp {no-ending
    (state <s> ^foo a b})
-->    (<s> ^foo bar)
}

--------------------------------------------------------------------------------

(source_file
  (production
    (prod_name)
    (condsForOneId
      (condType)
      (idTest
        (variable))
      (attrValueTests
        (string)
        (valueTest
          (string))
        (valueTest
          (string)))
      (ERROR))
    (variableMutation
      (variable)
      (attrValueMake
        (string)
        (valueMake
          (string))))))
