================================================================================
unary
================================================================================

sp {unary
    (state <s>)
-->    (<s> ^operator bar @)
}

--------------------------------------------------------------------------------

(source_file
  (production
    (prod_name)
    (condsForOneId
      (condType)
      (idTest
        (variable)))
    (variableMutation
      (variable)
      (attrValueMake
        (string)
        (valueMake
          (string)
          (unaryPreference))))))

================================================================================
unary
================================================================================

sp {unary
    (state <s>)
-->    (<s> ^operator <o> ~)
}

--------------------------------------------------------------------------------

(source_file
  (production
    (prod_name)
    (condsForOneId
      (condType)
      (idTest
        (variable)))
    (variableMutation
      (variable)
      (attrValueMake
        (string)
        (valueMake
          (variable)
          (unaryPreference))))))

================================================================================
double value
================================================================================

sp {double
    (state <s>)
-->    (<s> ^operator <o1> <o2>)
}

--------------------------------------------------------------------------------

(source_file
  (production
    (prod_name)
    (condsForOneId
      (condType)
      (idTest
        (variable)))
    (variableMutation
      (variable)
      (attrValueMake
        (string)
        (valueMake
          (variable))
        (valueMake
          (variable))))))

================================================================================
binary
================================================================================

sp {binary
    (state <s>)
-->    (<s> ^operator 1 < <o> )
}

--------------------------------------------------------------------------------

(source_file
  (production
    (prod_name)
    (condsForOneId
      (condType)
      (idTest
        (variable)))
    (variableMutation
      (variable)
      (attrValueMake
        (string)
        (valueMake
          (string)
          (binaryPreference
            (variable)))))))

================================================================================
multiple
================================================================================

sp {multiple
    (state <s>)
-->    (<s> ^operator <o1> <o2> + <o2> < <o1> <o3> =, <o4>)
}

--------------------------------------------------------------------------------

(source_file
  (production
    (prod_name)
    (condsForOneId
      (condType)
      (idTest
        (variable)))
    (variableMutation
      (variable)
      (attrValueMake
        (string)
        (valueMake
          (variable))
        (valueMake
          (variable)
          (unaryPreference))
        (valueMake
          (variable)
          (binaryPreference
            (variable)))
        (valueMake
          (variable)
          (unaryPreference))
        (valueMake
          (variable))))))
